[
  {
    "title": "EPIC: Core Agentic Platform Infrastructure",
    "body": "Goal: Establish the foundational backend, database, and configuration needed to run multi-agent workflows and integrate with GitHub and MCP tools.\n\nAcceptance criteria:\n- Backend service running locally with health check endpoint\n- Database created with migrations and basic schemas for Projects, Agents, Runs, and Integrations\n- Configuration system for secrets (GitHub token, model keys, MCP endpoints)\n- Basic logging and error handling in place\n",
    "labels": ["epic", "backend", "infrastructure", "priority:high"]
  },
  {
    "title": "STORY: Define project and workspace domain models",
    "body": "As a user, I want to create and manage projects/workspaces so that agents can operate on a specific idea, repo, and configuration.\n\nAcceptance criteria:\n- DB models for Project/Workspace with fields: name, description, repo URL, default stack, status\n- CRUD API (create, update, list, archive)\n- Seed script to create one demo project\n- Unit tests for model and API validation\n",
    "labels": ["story", "backend", "domain-model"]
  },
  {
    "title": "STORY: Implement MCP configuration and client layer",
    "body": "As a developer, I want a unified MCP client layer so agents can call tools (GitHub, filesystem, TypeScript, test runner) through a standard protocol instead of custom integrations.\n\nAcceptance criteria:\n- Config model for MCP servers (name, command, args, env, allowed resources)\n- Code to invoke MCP tools via JSON-RPC with error handling\n- Basic health check for at least one server (e.g., filesystem or GitHub)\n- Logging of each tool call (agent, tool, duration, result)\n",
    "labels": ["story", "backend", "mcp", "architecture"]
  },
  {
    "title": "STORY: Integrate GitHub issues and repos via MCP tools",
    "body": "As a PM/Scrum agent, I want to create and update GitHub issues and read repo metadata via MCP instead of calling the GitHub API directly.\n\nAcceptance criteria:\n- MCP server entry for GitHub with token-based auth\n- Utility functions for: list repos, list/create/update issues, apply labels, link milestones\n- Config option to associate a Project with a GitHub repo\n- Simple CLI or API endpoint to create a test issue from the platform\n",
    "labels": ["story", "integration", "github", "mcp", "priority:high"]
  },
  {
    "title": "EPIC: Multi-Agent Orchestrator Core",
    "body": "Goal: Create an orchestrator that coordinates PM, Scrum, Architect, Dev, QA, and DevOps agents and controls their use of MCP tools.\n\nAcceptance criteria:\n- Agent registry with roles, capabilities, and allowed tools\n- Orchestration engine with simple state machine (idea → requirements → issues → code → tests)\n- Persistence of runs with status and logs\n- Minimal API to start an orchestration run for a project\n",
    "labels": ["epic", "backend", "agents", "orchestration"]
  },
  {
    "title": "STORY: Implement Product Manager agent (requirements & epics)",
    "body": "As a Product Manager agent, I want to take a free-form idea and generate a product brief, themes, and initial epics so that downstream agents can plan and implement.\n\nAcceptance criteria:\n- Agent implementation that accepts: idea, constraints, target stack\n- Output schema: product brief, user personas, problem statements, feature themes, suggested epics\n- Orchestrator step: Run PM agent for project and save results in DB\n- At least one example run stored and viewable via API\n",
    "labels": ["story", "agent", "pm", "llm"]
  },
  {
    "title": "STORY: Implement Scrum Master agent for epics and user stories",
    "body": "As a Scrum Master agent, I want to convert epics into user stories and GitHub-ready issues with acceptance criteria and labels so the dev agents can work autonomously.\n\nAcceptance criteria:\n- Input: epics and product brief from PM agent\n- Output: list of stories and tasks with fields: title, body, labels, estimate, dependencies\n- GitHub issue creation through the GitHub MCP tool\n- Status and logs stored per planning run\n",
    "labels": ["story", "agent", "planning", "github"]
  },
  {
    "title": "STORY: Implement Developer agent with MCP filesystem and language tools",
    "body": "As a Developer agent, I want to read and modify code through MCP filesystem and language servers so that I can implement issues safely with validation.\n\nAcceptance criteria:\n- Agent that takes a single issue (with context) and proposed file edit plan\n- Uses MCP filesystem server to read/write files under a project root\n- Uses MCP language/TypeScript server (or similar) to get diagnostics for changes\n- Writes a summary of edits and test commands executed\n",
    "labels": ["story", "agent", "backend", "frontend", "mcp"]
  },
  {
    "title": "STORY: Implement QA agent and test runner MCP tool",
    "body": "As a QA agent, I want to run test suites via an MCP test runner tool so I can validate changes made by developer agents and open bug issues when tests fail.\n\nAcceptance criteria:\n- MCP server or tool definition for running tests (e.g., npm test or framework-specific)\n- Agent that triggers tests after a dev agent run and parses results (pass/fail, coverage if available)\n- Automatic creation of a GitHub bug issue when tests fail (title, repro steps, logs)\n- Status recorded on the orchestration run\n",
    "labels": ["story", "agent", "qa", "testing", "mcp"]
  },
  {
    "title": "EPIC: Web UI shell for projects, agents, and runs",
    "body": "Goal: Provide a modern, responsive UI for managing projects, viewing agent activity, and tracking orchestration runs.\n\nAcceptance criteria:\n- Layout with sidebar (Projects, Agents, Runs) and main content area\n- Project detail page showing idea, brief, epics, and issues\n- Run detail page showing timeline of steps (PM → Scrum → Dev → QA)\n- Basic auth and session management in place\n",
    "labels": ["epic", "frontend", "ui", "priority:medium"]
  },
  {
    "title": "STORY: Visualize agent runs and MCP tool calls",
    "body": "As a user, I want to see a timeline of which agents ran, what tools they called, and what artifacts they produced so I can understand and trust the automation.\n\nAcceptance criteria:\n- UI component that lists steps with timestamps, agent name, and status\n- Clicking a step shows tool calls, sanitized inputs, and outputs/links (e.g., GitHub issue, commit)\n- Filter by agent type and status (success, failed, skipped)\n",
    "labels": ["story", "frontend", "observability", "agents"]
  },
  {
    "title": "STORY: Provide MCP config templates for IDEs (Windsurf/Cursor/etc.)",
    "body": "As a developer, I want ready-to-use MCP config snippets so I can connect my IDE to the same MCP servers used by the platform.\n\nAcceptance criteria:\n- Example MCP config files for at least one IDE (e.g., Windsurf) checked into the repo\n- Docs page describing how to point IDE MCP clients at project MCP servers\n- One sample workflow: open project in IDE, call implement issue #X via IDE agent using the same tools\n",
    "labels": ["story", "ide", "mcp", "docs"]
  },
  {
    "title": "STORY: Create initial automation workflow for project creation",
    "body": "As an operator, I want a reusable automation workflow so creating a new project can trigger generation of epics, issues, and initial agent runs automatically.\n\nAcceptance criteria:\n- Basic workflow definition (e.g., JSON or YAML) for on project_created → call PM → Scrum → GitHub issues\n- Stored under an automation or n8n-workflows directory in the repo\n- README section explaining how to import/use the workflow\n",
    "labels": ["story", "automation", "n8n", "planning"]
  },
  {
    "title": "STORY: Document agent roles and MCP architecture",
    "body": "As a contributor, I want clear docs describing each agent, the orchestrator, and the MCP tool layer so I can extend the system safely.\n\nAcceptance criteria:\n- Architecture page explaining host ↔ MCP client ↔ MCP server pattern\n- Agent reference: PM, Scrum, Architect, Dev, QA, DevOps and their allowed tools\n- Sequence diagram (e.g., Mermaid) for a typical idea → deployed code flow\n",
    "labels": ["story", "documentation", "architecture"]
  },
  {
    "title": "TASK: Add GitHub issue templates (Epic, Story, Task, Bug)",
    "body": "Create standardized issue templates so new issues are consistent with the agentic planning model.\n\nAcceptance criteria:\n- .github/ISSUE_TEMPLATE/epic.md\n- .github/ISSUE_TEMPLATE/story.md\n- .github/ISSUE_TEMPLATE/task.md\n- .github/ISSUE_TEMPLATE/bug.md\n- Optional config.yml that shows these templates in the new-issue chooser\n",
    "labels": ["task", "meta", "github", "docs"]
  }
]
